Revit 2027 API
Space.DesignHeatingLoad Property
Get or set the Design Heating Load of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DesignHeatingLoad { get; set; }
Public Property DesignHeatingLoad As Double
	Get
	Set
public:
property double DesignHeatingLoad {
	double get ();
	void set (double value);
}
member DesignHeatingLoad : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Design Heating Load of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace